Revit 2027 API
DisplacementElement.SetRelativeDisplacement Method
 Sets the relative displacement applied to the displaced elements by this DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRelativeDisplacement(
	XYZ displacement
)
Public Sub SetRelativeDisplacement (
	displacement As XYZ
)
public:
void SetRelativeDisplacement(
	XYZ^ displacement
)
member SetRelativeDisplacement :
        displacement : XYZ -> unit
Parameters
displacement XYZ
 The relative displacement.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace